nxp-mcuxpresso/mcux-sdk-examples/lpcxpresso845max/driver_examples/dac/lpc_dac_interrupt/pin_mux.h
/*
 * Copyright  2018 ,2021 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOCON_PIO_CLKDIV0 0x00u        /*!<@brief IOCONCLKDIV0 */
#define IOCON_PIO_DACMODE_EN 0x010000u /*!<@brief Enables DAC mode */
#define IOCON_PIO_HYS_EN 0x20u         /*!<@brief Enable hysteresis */
#define IOCON_PIO_INV_DI 0x00u         /*!<@brief Input not invert */
#define IOCON_PIO_MODE_INACT 0x00u     /*!<@brief No addition pin function */
#define IOCON_PIO_MODE_PULLUP 0x10u    /*!<@brief Selects pull-up function */
#define IOCON_PIO_OD_DI 0x00u          /*!<@brief Disables Open-drain function */
#define IOCON_PIO_SMODE_BYPASS 0x00u   /*!<@brief Bypass input filter */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M0P */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
